In [1]:
import pandas as pd
import os

In [2]:
schools_csv = "Resources/schools_complete.csv"
students_csv = "Resources/students_complete.csv"

In [3]:
schools_df = pd.read_csv(schools_csv)
students_df = pd.read_csv(students_csv)

In [4]:
schools_df

    School ID            school_name         type  size   budget
0           0      Huang High School   Government  2917  1910635
1           1   Figueroa High School   Government  2949  1884411
2           2    Shelton High School  Independent  1761  1056600
3           3  Hernandez High School   Government  4635  3022020
4           4    Griffin High School  Independent  1468   917500
5           5     Wilson High School  Independent  2283  1319574
6           6    Cabrera High School  Independent  1858  1081356
7           7     Bailey High School   Government  4976  3124928
8           8     Holden High School  Independent   427   248087
9           9       Pena High School  Independent   962   585858
10         10     Wright High School  Independent  1800  1049400
11         11  Rodriguez High School   Government  3999  2547363
12         12    Johnson High School   Government  4761  3094650
13         13       Ford High School   Government  2739  1763916
14         14     Thomas High School  Independent  1635  1043130

In [5]:
students_df.head()

,Student ID,student_name,gender,year,school_name,reading_score,maths_score
0,0,Paul Bradley,M,9,Huang High School,96,94
1,1,Victor Smith,M,12,Huang High School,90,43
2,2,Kevin Rodriguez,M,12,Huang High School,41,76
3,3,Richard Scott,M,12,Huang High School,89,86
4,4,Bonnie Ray,F,9,Huang High School,87,69

In [6]:
merge_df = pd.merge(schools_df, students_df, on="school_name")
merge_df

,School ID,school_name,type,size,budget,Student ID,student_name,gender,year,reading_score,maths_score
0,0,Huang High School,Government,2917,1910635,0,Paul Bradley,M,9,96,94
1,0,Huang High School,Government,2917,1910635,1,Victor Smith,M,12,90,43
2,0,Huang High School,Government,2917,1910635,2,Kevin Rodriguez,M,12,41,76
3,0,Huang High School,Government,2917,1910635,3,Richard Scott,M,12,89,86
4,0,Huang High School,Government,2917,1910635,4,Bonnie Ray,F,9,87,69
...,...,...,...,...,...,...,...,...,...,...,...
39165,14,Thomas High School,Independent,1635,1043130,39165,Donna Howard,F,12,51,48
39166,14,Thomas High School,Independent,1635,1043130,39166,Dawn Bell,F,10,81,89
39167,14,Thomas High School,Independent,1635,1043130,39167,Rebecca Tanner,F,9,99,99
39168,14,Thomas High School,Independent,1635,1043130,39168,Desiree Kidd,F,10,72,77
39169,14,Thomas High School,Independent,1635,1043130,39169,Carolyn Jackson,F,11,47,62

In [7]:
#calculate the total number of schools
schools_count = len(merge_df["school_name"].unique())
schools_count

15

In [8]:
#calculate the total number of students
student_count = len(merge_df["Student ID"].unique())
student_count

39170

In [9]:
#calculate the total budget
total_budget = schools_df["budget"].sum()
total_budget

24649428

In [10]:
#calculate the average maths score
avg_maths = merge_df["maths_score"].mean()
avg_maths

70.33819249425581

In [11]:
#calculate the average reading score
avg_read = merge_df["reading_score"].mean()
avg_read

69.98013786060761

In [12]:
#Calculate the percentage of students with a passing maths score (50 or greater)
math_pass = merge_df.loc[merge_df["maths_score"] >= 50]
math_pass_number = math_pass["Student ID"].count()

math_pass_perc = (math_pass_number / student_count) * 100
math_pass_perc

86.07863160582077

In [13]:
#Calculate the percentage of students with a passing reading score (50 or greater)
read_pass = merge_df.loc[merge_df["reading_score"] >= 50]
read_pass_number = read_pass["Student ID"].count()

read_pass_perc = (read_pass_number / student_count) * 100
read_pass_perc

84.42685728874139

In [22]:
#Calculate the percentage of overall number of students with a total passing score (50 or greater)
overall_pass = students_df[(students_df['maths_score'] >= 50) & (students_df['reading_score'] >= 50)]['Student ID'].count()/student_count*100
overall_pass

72.80827163645647

In [23]:
#summary dataframe for school district
dist_summary = pd.DataFrame({
    "Total Schools": schools_count,
    "Total Students": f"{student_count:,.0f}",
    "Total Budget": f"${total_budget:,.2f}",
    "Avg. Maths Score": f"{avg_maths:,.2f}",
    "Avg. Reading Score": f"{avg_read:,.2f}",
    "% Maths Pass": f"{math_pass_perc:,.2f}",
    "% Reading Pass": f"{read_pass_perc:,.2f}",
    "% Overall Pass": f"{overall_pass:,.2f}"
}, index=[0])

dist_summary

,Total Schools,Total Students,Total Budget,Avg. Maths Score,Avg. Reading Score,% Maths Pass,% Reading Pass,% Overall Pass
0,15,"39,170","$24,649,428.00",70.34,69.98,86.08,84.43,72.81

In [ ]:
#summary dataframe for school district
full_summary = pd.DataFrame({
    "School": 
    "School Type":
    "Total Students"
    "Total School Budget"
    "Per Student Budget"
    "Avg. Maths Score"
    "Avg. Reading Score"
    "% Maths Pass"
    "% Reading Pass"
})